app/controllers/songs_controller.rb

  def create
    puts params
    artist = params[:artist]
    genre = params[:genre]
    user = User.get_by_username(params[:username])
    name = params[:name]
    file = params[:audio_file]
    song = Song.new({artist: artist, genre: genre, name: name })
    song.user = user
    song.song_file.attach(file)

    if song.save
---
INSERT INTO "songs" ("name", "genre", "artist", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "songs" ("name", "genre", "artist", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "bugs-name"], ["genre", "bugs-genre"], ["artist", "bugs-artist"], ["user_id", 1], ["created_at", "2019-10-21 20:55:42.240318"], ["updated_at", "2019-10-21 20:55:42.240318"]]

  def destroy
    id = params[:id]
    song = Song.destroy(id)
---
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 28]]

  def get_by_user
    # user = User.find_by(email: params[:username])
    user = User.get_by_username(params[:username])
    songData = user.songs.map {|song|
---
SELECT "users".* FROM "users"
SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = $1  [["user_id", 1]]