app/models/user.rb

  def self.get_by_username(username)
    User.all.find{|user| user.email.include?(username)}
---
SELECT "users".* FROM "users"